nc: 10
scales:
  l: [1.00, 1.00, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]

  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 1, C2f_EfficientVIM_CGLU, [128]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 1, C2f_EfficientVIM_CGLU, [256]]

  - [-1, 1, Conv, [384, 3, 2]]
  - [-1, 1, C2f_EfficientVIM_CGLU, [384]]

  - [-1, 1, Conv, [384, 3, 2]]
  - [-1, 3, C2f_EfficientVIM_CGLU, [384]]

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]

  - [-1, 1, TransformerEncoderLayer_Pola_SEFN_Mona_DyT, [1024, 8]]

  - [-1, 1, Conv, [256, 1, 1]]

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [6, 1, Conv, [256, 1, 1, None, 1, 1, False]]
  - [[-2, -1], 1, Concat, [1]]
  - [-1, 3, RepC3, [256, 0.5]]
  - [-1, 1, Conv, [128, 1, 1]]

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]

  - [2, 1, SPDConv, [128]]

  - [[-1, -2, 4], 1, Concat, [1]]

  - [-1, 1, CSPOmniKernel, []]

  - [-1, 3, RepC3, [256, 0.5]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 16], 1, Concat, [1]]
  - [-1, 3, RepC3, [256, 0.5]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]
  - [-1, 3, RepC3, [256, 0.5]]

  - [[21, 24, 27], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]
